In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.randint(10,100,(3,4))

array([[94, 98, 83, 31],
       [36, 12, 20, 89],
       [85, 83, 18, 44]])

In [3]:
pd.DataFrame(np.random.randint(10,100,(3,4)))

    0   1   2   3
0  17  25  69  77
1  28  88  85  11
2  15  98  54  18

In [5]:
pd.DataFrame(np.random.randint(10,100,(3,3)),columns=['x1','x2','x3'], index=['a1','a2','a3'])

    x1  x2  x3
a1  62  81  96
a2  62  28  70
a3  19  15  53

In [6]:
pd.DataFrame(np.random.randint(10,100,(3,3)),columns="age sales gp".split(), index=['a1','a2','a3'])

    age  sales  gp
a1   75     66  76
a2   17     81  37
a3   59     16  98

In [12]:
df=pd.DataFrame(np.random.randint(10,100,(3,3)),columns="age sales gp".split(), index=['c1','c2','c3'])

In [14]:
df.values

array([[34, 81, 90],
       [49, 46, 47],
       [85, 29, 49]])

In [13]:
df['age']

c1    34
c2    49
c3    85
Name: age, dtype: int32

In [16]:
df[['age','sales']]

    age  sales
c1   34     81
c2   49     46
c3   85     29

In [18]:
df['c1':'c2']

    age  sales  gp
c1   34     81  90
c2   49     46  47

In [ ]:
### application train
1. Find the total number of columns in the dataset
2. Find numerical cat columns in the dataset
3. Find columns that has null value percentages beyond 60%
4. Find columns that has highest null values
5. Divide the columns into numerical_cont, numerica